export type ApiProduct = {
  id: string;
  price: number;
  title: string;
  img: string;
  description: string;
}[];

const product: ApiProduct = [
  {
    title: "Самый лучший дед",
    img: "https://images.wbstatic.net/big/new/3110000/3114939-1.jpg",
    price: 674,
    description:
      "Мужская футболка MF с надписью 'Самый лучший дед' - это отличный подарок любимому дедушке, подчеркивающий его важность, ценность и нужность в семье. Для того, чтобы сделать подарок деду - не нужны особые поводы, но футболка свободного кроя из дышащего материала станет приятным подарком как на День рождения, так и на 23 февраля, и на Новый год. Надевая футболку из 100% хлопка каждый день, дедушка будет чувствовать заботу своей семьи. Выражайте чувства любимым людям как можно чаще вместе с МФ!",
    id: "1",
  },
  {
    title: "Футболка / Твое",
    img: "https://images.wbstatic.net/big/new/45310000/45318531-1.jpg",
    price: 899,
    description:
      "Футболка изготовлена из мягкой, тактильно-приятной ткани, базовый элемент гардероба на каждый день. Футболка, 100% Хлопок, крой: Oversize, принт, вырез: U-образная.",
    id: "2",
  },
  {
    title: "Дисконт Центр / Футболка",
    img: "https://images.wbstatic.net/big/new/35240000/35246924-1.jpg",
    price: 499,
    description:
      "Lorem ipsum dolor sit amet, consectetur adipisicing elit. Deleniti iste nobis minima. Culpa quaerat ex numquam debitis, alias quo eius aperiam autem natus aliquam est blanditiis dolor nihil asperiores perspiciatis.",
    id: "3",
  },
  {
    title: "Макс-Экстрим",
    img: "https://images.wbstatic.net/big/new/4160000/4161401-1.jpg",
    price: 700,
    description:
      "Мужская футболка Пауэрлифтинг - Выживает Сильнейший! Отличное турецкое полотно с точным составом 92% хлопка и 8% лайкры Футболка со стилизованным изображение бога Тора , для всех",
    id: "4",
  },
  {
    title: "Нити-Нити / Футболка",
    img: "https://images.wbstatic.net/big/new/10020000/10029395-1.jpg",
    price: 1200,
    description:
      "- Футболка мужская с принтом Енот Леон, кот ОНО, Собака доктор (trust me), Ротвейлер, клоунские танцы, Колдун с пиццей. Новинка -футболка мужская с принтом 'Лис Леон', который прекрасно дополнит женскую футболку с принтом 'Зайка Матильда', арт - 58250607 и будет прекрасным подарком для девушек в День святого Валентина (14 февраля). Футболка мужская, прямого кроя с оптимальной плотностью на любой сезон и на каждый день!- Прекрасно подойдет на подарок коллегам, друзьям и родным.- Ориентируйтесь на размерную сетку, но если вы предпочитаете более объемный вид, советуем взять на размер больше.- Дышащий принт. Принт нанесен методом прямой цифровой печати на лучшем оборудовании в России (KORNIT STORM HEXA). Отлично переносит ручную и механическую стирку, за изделием легко ухаживать. Трикотаж пенье - премиум класс. При стирке и эксплуатации вещи из пенье не растягиваются, не деформируются, швы на них не смещаются.- А на артикуле 14230663, танцы по кф 'криминальное чтиво'!",
    id: "5",
  },
  {
    title: "Baomiks",
    img: "https://images.wbstatic.net/big/new/40880000/40883622-1.jpg",
    price: 900,
    description:
      "Прописана цена одного товара. Для выбора остальных товаров надо в строке 'Я ищу..' ввести артикул женской модели - 40558205, артикул детской модели - 40883270. Если хотите выделить свою семью среди других, то вам нужно приобрести семейный комплект 'Веселый Санта'. Оригинальная одежда для каждого члена семьи - это так по-семейному. Одежда family look поможет создать вам классный гармоничный образ для фотосессии. Получится отличная фотография для семейного фотоальбома. Ваша семья будет прекрасно смотреться в фэмили лук. Качество вас не разочарует - 90% хлопок, 10% эластан. Особенно хороша такая ткань для ребенка, ведь малышу нужно самое лучшее в плане здоровья, а эта ткань гипоаллергенна. Просто выберите идеальный вариант, кликните добавить в корзину и оформите заказ. Но прежде обратите внимание, что товары строго указанного размера. Закажите футболки посвободнее, что б уж наверняка.",
    id: "6",
  },
  {
    title: "МР / Черная футболка",
    img: "https://images.wbstatic.net/big/new/21420000/21429620-1.jpg",
    price: 870,
    description:
      "Мужская футболка (черная и белая) Мяуталика, выполнена из чистого 100% хлопка, с короткими рукавами и округлым вырезом горловины. Отличный подарок для поклонников Металлика. Её можно купить и мальчику и девочке на каждый день! Майки унисекс, подходят на любую фигуру как женщины, так и мужчины. Мягкий хлопок позволит коже дышать, а красивый, износостойки принт привлечет внимание и станет хорошим подарком на день рождения или Новый Год. Meowtallica / Мяуталлика / Мяуталика / Metallica футболка мужская хлопок футболка женская оверсайз топ топик смешная футболка женская новогодняя футболка с надписью мужская футболка с принтом подарок подарок мужу подарок девушке подарок парню подарок жене подарок любимой подарок коллеге подарок подруге подарок другу буква ю большой размер подарки с приколом 18+ с надписью подруге любую металлика погоду приколы буквы футболка мужская с надписью подарок мужчине подарок другу музыкант подарок папе пивозавр подарок дедушке подарок любимому кежуал с приколом",
    id: "7",
  },
  {
    title: "adidas / Футболка",
    img: "https://images.wbstatic.net/big/new/27740000/27749242-1.jpg",
    price: 1300,
    description:
      "Lorem ipsum dolor sit amet, consectetur adipisicing elit. Deleniti iste nobis minima. Culpa quaerat ex numquam debitis, alias quo eius aperiam autem natus aliquam est blanditiis dolor nihil asperiores perspiciatis.",
    id: "8",
  },
  {
    title: "Твое / Футболка",
    img: "https://images.wbstatic.net/big/new/49410000/49411135-1.avif",
    price: 800,
    description:
      "Футболка изготовлена из мягкой, тактильно-приятной ткани, базовый элемент гардероба на каждый день.",
    id: "9",
  },
];

const getApiProduct = () => {
  return product;
};

export default getApiProduct;
